Repository: eunhyekoo/glo_project
Catalog: feedback/TMData/[Naver] WEBTOON ID>EN, BLUE.tmx
Source language: id
Languages: en

source: lalu kabar baiknya, caca akhirnya mendapat pekerjaan sebagai staf tata usaha di sekolahku
en: and the good news was, caca had finally gotten a position as a clerk at my school.

source: srrr
en: whoosh

source: neng kalau mau yang modelnya mirip kayak gitu ada...
en: I’ll show you the ones that look similar.

source: m-maksudmu dia bohong gitu ?!
en: are you saying he’d been lying to us?!

source: ah bodoh
en: idiot

source: aku pun tertidur
en: I fell asleep.

source: MASA AKU MAIN SAMA NENEK2?
en: and playing with a granny?

source: tunggu juni!
en: juni, wait!

source: kalian inget kan aku pernah gambar jim pakai kacamata besar?
en: remember when I drew jimmy as someone with big glasses?

source: jadi di rumah sendiri?
en: so I’ll be alone tonight?

source: ampun!
en: mercy!

source: kalau ketemu sama orang yang ngaku-ngaku temen kecilnya juga rasanya canggung ngga sih
en: then again, if I came to her out of the blue, telling her that I knew her, it’d be kinda awkward, right?

source: jim aku tahu tadi itu kamu!
en: jimmy, I know it was you!

source: aku ngga mau kayak si juragan itu yang maksa orang lain hidup sama dia
en: I’m not like that old man who forced other person to live with him .

source: Halo Juni apa kabarmu?
en: hello, juni. how are you?

source: udah beluum?
en: are you done yet?

source: poling?
en: the wandering pocong?

source: ayah cepetannn!!
en: dad, hurry!

source: apa..? ada apa?
en: what is it? what’s going on?

source: aku ngga pernah bilang kalau orang tuaku meninggal karena kecelakan kereta juga..?
en: ...I ever told you about my parents who died in a railroad crossing accident?

source: yang dulu rasanya sulit kumengerti karena orangtuaku telah tiada
en: which i couldn’t really comprehend due to both of my parents passed away.

source: ooh
en: yeah?

source: nginep bu, kecapekan di jalan
en: we made a stop, we were too tired.

source: bu..
en: ma’am...

source: Hal-hal sepele seperti itu sangat berharga untukku
en: those ordinary stuffs were really precious to me.

source: ini spontan uhuy ya?
en: is it a TV prank show or what?

source: padahal aku tahu..
en: I knew so well...

source: iya juga ya..
en: yeah, that’s right.

source: cuman dia emang rada aneh sih haha
en: but he was kinda weird though, haha.

source: juni! dari mana?
en: juni! where have you been?

source: em.. itu..
en: well, um...

source: bruk
en: thud

source: entah itu benar-benar dia..
en: I’m not sure if it was him.

source: itu merk kacamata mahal mba, makanya jarang di sini mah yang jual
en: that’s an expensive brand, Miss, you’d rarely find it being sold here.

source: ...tapi coba sesekali lihat sekelilingmu
en: but try to see the people around you.

source: sekarang tidur
en: time to sleep.

source: nama asliku Damar
en: my real name is damar.

source: katanya..
en: he said...

source: GA ASIK
en: that sucks.

source: apa damar sempet sadar terus nulis itu?
en: did he write those while he was awake?

source: juni mau ikut masuk ngga?
en: juni, wanna come in too?

source: a-ahaha! engga kok
en: haha, of course, not.

source: kalau aku...
en: as for me...

source: mas habis ini tolong ganti lampu kamar belakang ya
en: please change the backroom light when you’re done with this.

source: eyang!
en: grandma!

source: bis kita!
en: it’s our bus!

source: ‘Apa kamu masih dihantui masa lalu?’
en: I was like, “is your past still haunting you?”

source: apa aku ada salah?
en: what did I do wrong?

source: backgroundnya lope-lope aja gimana?
en: would you want a heart-filled background?

source: waah ini si radi? rambutnya makin kriwil ya mirip bapakn-
en: is this radi? you have curly hair, just like your...

source: kacamata jim adalah hal detail lain yang melekat ditubuhnya selain celana sekolahnya
en: aside from his uniform pants is his glasses that stuck with him.

source: halo dek?
en: Hello?

source: aku bekerja keras
en: I worked so hard.

source: bohong
en: you lie.

source: oke makasih!
en: okay, thank you!

source: ah engga kok
en: not really

source: ini semua gara-gara kamu
en: it was all because of you.

source: sayang..??
en: “honey”?

source: brrrmmm
en: vroom

source: orang normal mana yang punya pikiran seperti itu?
en: who, in their right mind, would think such things?

source: Tidak lama dari kepergianmu, aku juga akhirnya pindah rumah
en: I left the neighborhood not long after you left.

source: cinta satu malam oh indahnya!~
en: one night stand, oh, it’s so lovely~

source: terus kita bawa-bawa setan gitu ampe sana?
en: and bringing a ghost until we arrive there?.

source: aaah.. gimana ini..
en: what do we do?

source: aku tahu kamu kehilangan jim, tapi-
en: I know jimmy left you, but--

source: kenapa dia seakan bersembunyi?
en: why did he seem to be hiding?

source: oh iya jadi inget
en: oh, I almost forgot.

source: bunda nanti ke pasar malem ya
en: let’s go to the night market tonight!
